/**@mainpage
* s21_smartcalc — это приложение, которое позволяет вычислять некоторые
* математические выражения. Этот калькулятор состоит из трех разделов:
* 1. Калькулятор
* Программа может принимать и вычислять любые выражения в
* инфиксной нотации, а также строить график функции, если в выражении есть
* переменная. Область определения такой функции от -10 до 10.
* 2. Кредитный калькулятор
* Программа может рассчитывать проценты, переплату и ежемесячные
* платежи по кредиту.
* 3. Депозитный калькулятор
* Программа может рассчитывать выгоду от вкладов различных типов.

* Сборка и удаление
* Для установки программы запустите команду make all или make install.
* Для удаления программы воспользуйтесь make uninstal. Для удаления
* всех промежуточных файлов воспользуйтесь командой make clean.
* Для запуска unit-тестов используйте команду make test.
* Для генерации отчета о покрытии тестами используйте команду make
* gcov_report
* Для архивации исходного кода программы используйте make dist
*
*/